In [28]:
import pandas as pd
import numpy as np
from sqlalchemy import text, create_engine

from env import get_connection

In [ ]:
'''

def get_connection(db, user=username, host=host, password=password):
    return f'mysql+pymysql://{user}:{password}@{host}/{db}'

'''

In [29]:
employees = get_connection('employees')

Use your function to obtain a connection to the employees database.

In [30]:
engine = create_engine(employees)

In [31]:
query = '''

SELECT *
FROM dept_emp
'''

In [32]:
text_query = text(query)

In [33]:
dept_emp = pd.read_sql(text_query, engine.connect())
dept_emp.head()

   emp_no dept_no   from_date     to_date
0   10001    d005  1986-06-26  9999-01-01
1   10002    d007  1996-08-03  9999-01-01
2   10003    d004  1995-12-03  9999-01-01
3   10004    d004  1986-12-01  9999-01-01
4   10005    d003  1989-09-12  9999-01-01

5. Once you have successfully run a query:

a. Intentionally make a typo in the database url. What kind of error message do you see?

OperationalError: (pymysql.err.OperationalError) (1044, "Access denied for user 'somerville_2274'@'%%' to database 'employee'")
(Background on this error at: https://sqlalche.me/e/14/e3q8)
Output is truncated. View as a scrollable element or open in a text editor. Adjust cell output settings...

b. Intentionally make an error in your SQL query. What does the error message look like?

ProgrammingError: (pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'FROM dept_emp' at line 3")

6. Read the employees and titles tables into two separate DataFrames.

In [35]:
query_2 ='''

SELECT *
FROM employees
;
'''

In [36]:
text_query_2 = text(query_2)

In [39]:
employees = pd.read_sql(text_query_2, engine.connect())
employees.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [40]:
query_3 = '''

SELECT *
FROM titles
;
'''

In [41]:
text_query_3 = text(query_3)

In [43]:
titles = pd.read_sql(text_query_3, engine.connect())
titles.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

7. How many rows and columns do you have in each DataFrame? Is that what you expected?
Looks like the whoel thing is imported. That makes sense

In [44]:
titles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443308 entries, 0 to 443307
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   emp_no     443308 non-null  int64
 1   title      443308 non-null  object
 2   from_date  443308 non-null  object
 3   to_date    443308 non-null  object
dtypes: int64(1), object(3)
memory usage: 13.5+ MB

In [45]:
employees.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

8. Display the summary statistics for each DataFrame.

In [46]:
titles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443308 entries, 0 to 443307
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   emp_no     443308 non-null  int64
 1   title      443308 non-null  object
 2   from_date  443308 non-null  object
 3   to_date    443308 non-null  object
dtypes: int64(1), object(3)
memory usage: 13.5+ MB

9. How many unique titles are in the titles DataFrame?
7

In [48]:
titles.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [53]:
titles.dtypes

emp_no        int64
title        object
from_date    object
to_date      object
dtype: object

In [54]:
titles.value_counts('title')

title
Engineer              115003
Staff                 107391
Senior Engineer        97750
Senior Staff           92853
Technique Leader       15159
Assistant Engineer     15128
Manager                   24
dtype: int64

In [55]:
len(titles.value_counts('title'))

7

10. What is the oldest date in the to_date column?
1985-03-01

In [60]:
titles.sort_values(by = 'to_date' , ascending = True).head(1)

       emp_no     title   from_date     to_date
16064   20869  Engineer  1985-02-17  1985-03-01

In [63]:
titles.to_date.min()

datetime.date(1985, 3, 1)

11. What is the most recent date in the to_date column?
9999-01-01

In [64]:
titles.to_date.max()

datetime.date(9999, 1, 1)

In [61]:
titles.sort_values(by = 'to_date' , ascending = False).head(1)

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01